In [3]:
import pandas as pd
import numpy as np

## 2. DataFrame with Specified Index Labels

Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

In [11]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [12]:
exam_data_df = pd.DataFrame(exam_data,index=labels)
print(exam_data_df)

        name  attempts  score qualify
a  Anastasia         1   12.5     yes
b       Dima         3    9.0      no
c  Katherine         2   16.5     yes
d      James         3    NaN      no
e      Emily         2    9.0      no
f    Michael         3   20.0     yes
g    Matthew         1   14.5     yes
h      Laura         1    NaN      no
i      Kevin         2    8.0      no
j      Jonas         1   19.0     yes

## 3. DataFrame Basic Summary Information

Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [17]:


exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data_df = pd.DataFrame(exam_data,index = labels)
print(exam_data_df)
print(exam_data_df.info())

        name  attempts  score qualify
a  Anastasia         1   12.5     yes
b       Dima         3    9.0      no
c  Katherine         2   16.5     yes
d      James         3    NaN      no
e      Emily         2    9.0      no
f    Michael         3   20.0     yes
g    Matthew         1   14.5     yes
h      Laura         1    NaN      no
i      Kevin         2    8.0      no
j      Jonas         1   19.0     yes
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   attempts  10 non-null     int64
 2   score     8 non-null      float64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

## 4. Selecting the First 3 Rows

Write a Pandas program to get the first 3 rows of a given DataFrame.

In [ ]:


exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data_df = pd.DataFrame(exam_data,index = labels)
print(exam_data_df)
print(exam_data_df.iloc[0:3])

        name  attempts  score qualify
a  Anastasia         1   12.5     yes
b       Dima         3    9.0      no
c  Katherine         2   16.5     yes
d      James         3    NaN      no
e      Emily         2    9.0      no
f    Michael         3   20.0     yes
g    Matthew         1   14.5     yes
h      Laura         1    NaN      no
i      Kevin         2    8.0      no
j      Jonas         1   19.0     yes
        name  attempts  score
a  Anastasia         1   12.5
b       Dima         3    9.0
c  Katherine         2   16.5

## 5. Selecting 'name' and 'score' Columns

Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [35]:
exam_data_df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

## 6. Selecting Specific Columns and Rows

Write a Pandas program to select the specified columns and rows from a given data frame.

In [36]:
exam_data_df.loc[["b","d","f","g"],["score","qualify"]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

## 7. Selecting Rows Where Attempts > 2

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [ ]:
attempt_ind = exam_data_df["attempts"]>2
exam_data_df[attempt_ind]

      name  attempts  score qualify
b     Dima         3    9.0      no
d    James         3    NaN      no
f  Michael         3   20.0     yes

## 8. Counting Rows and Columns

Write a Pandas program to count the number of rows and columns of a DataFrame.

In [47]:
exam_data_df.shape

(10, 4)

## 9. Selecting Rows with Missing Score

Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [94]:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data_df = pd.DataFrame(exam_data, index = labels)
na_ind = exam_data_df["score"].isna()
print(exam_data_df[na_ind])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

10. Selecting Rows Where Score is Between 15 and 20

Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [98]:
print(exam_data_df)
exam_data_df = exam_data_df.dropna()
score_ind =(exam_data_df["score"]>=15)& (exam_data_df["score"]<=20)
exam_data_df[score_ind]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes


## 11. Selecting Rows with Attempts < 2 and Score > 15

Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [96]:
ind = (exam_data_df["attempts"]<2) &(exam_data_df["score"]>15) 
print(exam_data_df[ind])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

## 12. Changing the Score in a Specific Row

Write a Pandas program to change the score in row 'd' to 11.5.

In [116]:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}


labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_data_df = pd.DataFrame(exam_data,index = labels)
exam_data_df.loc[["d"],["score"]] =11.5

exam_data_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## 13. Summing Examination Attempts

Write a Pandas program to calculate the sum of the examination attempts by the students.

Sample Python dictionary data and list labels:

In [131]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data_df = pd.DataFrame(exam_data, index= labels)

exam_data_df["attempts"].sum()

19

14. Calculating the Mean of Scores

Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe.

In [146]:
stat_df = exam_data_df.mean()
stat_df = stat_df.reset_index()
stat_df.rename(columns={"index":"mean"},inplace=True)
stat_df

C:\Users\pvwol\AppData\Local\Temp\ipykernel_24040\3702118723.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  stat_df = exam_data_df.mean()

       mean        0
0     score  13.5625
1  attempts   1.9000

## 15. Appending and Deleting a New Row

Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [183]:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

exam_data_df = pd.DataFrame(exam_data,index = labels)

exam_data_df.loc["k"] = ["Suresh",15.5,1,"yes"]

print(exam_data_df)
exam_data_df.drop("k",inplace=True)
exam_data_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## 16. Sorting the DataFrame by Multiple Columns

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [158]:
print(exam_data_df.sort_values(by="name",ascending=False))
print(exam_data_df.sort_values(by="score",ascending=True))

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes
        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
d      James    NaN         3      no
h      Laura    NaN         1      no

## 17. Replacing Column Values (qualify)

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [226]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


exam_data_df = pd.DataFrame(exam_data,index = labels)

In [213]:
yes_ind = exam_data_df["qualify"] =="yes"
exam_data_df.loc[yes_ind,"qualify"] = True

no_ind = exam_data_df["qualify"] =="no"
exam_data_df.loc[no_ind,"qualify"] =False

In [225]:
exam_data_df["qualify"] = exam_data_df["qualify"].map({"yes":True, "no":False})
exam_data_df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

## 18. Changing a Specific Name Value

Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [239]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


exam_data_df = pd.DataFrame(exam_data,index = labels)

In [238]:
james_ind = exam_data_df["name"]=="James"

exam_data_df.loc[james_ind,"name"] ="Suresh"

exam_data_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [241]:
exam_data_df["name"] = exam_data_df["name"].replace("James","Suresh")
exam_data_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

19. Deleting a Column from the DataFrame

Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [244]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


exam_data_df = pd.DataFrame(exam_data,index = labels)

In [245]:


exam_data_df.pop("attempts")
exam_data_df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

## 20. Inserting a New Column

Write a Pandas program to insert a new column in existing DataFrame.

In [252]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


exam_data_df = pd.DataFrame(exam_data,index = labels)

In [253]:
retard = [number for number in np.random.uniform(0,10,exam_data_df.shape[0])]

exam_data_df["retard spectrum value"] =retard

exam_data_df

        name  score  attempts qualify  retard spectrum value
a  Anastasia   12.5         1     yes               8.284333
b       Dima    9.0         3      no               7.983350
c  Katherine   16.5         2     yes               8.465807
d      James    NaN         3      no               9.923777
e      Emily    9.0         2      no               5.550005
f    Michael   20.0         3     yes               9.695000
g    Matthew   14.5         1     yes               6.465236
h      Laura    NaN         1      no               3.762095
i      Kevin    8.0         2      no               7.112753
j      Jonas   19.0         1     yes               2.889494

21. Iterating Over DataFrame Rows

Write a Pandas program to iterate over rows in a DataFrame.

In [264]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df= pd.DataFrame(exam_data)

In [279]:
print("Expected results")
for index, row in df.iterrows():
    print(row["name"],row["score"])

Expected results
Anastasia 12.5
Dima 9.0
Katherine 16.5

## 22. Getting List from Column Headers

Write a Pandas program to get list from DataFrame column headers.

In [285]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index = labels)

col_list =[column for column in df.columns]
col_list

['name', 'score', 'attempts', 'qualify']

## 73.

In [2]:

import pandas as pd
df1 =pd.util.testing.makeDataFrame()
print(df1)
df2 = pd.util.testing.makeMissingDataframe()
print(df2)
df3 = pd.util.testing.makeTimeDataFrame()
print(df3)
df4 = pd.util.testing.makeMixedDataFrame()
print(df4)

AttributeError: module 'pandas.util' has no attribute 'testing'

In [ ]:
df = pd.DataFrame({"col1":[1,2,3],
                   "col2":[4,5,6],
                   "col3":[7,8,9]})


new_cols =["Column 1", "Column 2", "Column 3"]

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9